In [1]:
import numpy as np
import pandas as pd
import os
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df1=pd.DataFrame(np.array([['a',1,2],['w',5,7],['l',4,5]]),columns=['name','arr1','arr2'])

In [3]:
df1

  name arr1 arr2
0    a    1    2
1    w    5    7
2    l    4    5

In [4]:
df2=pd.DataFrame(np.array([['a',1,2],['t',2,3],['u',4,5]]),columns=['name','arr3','arr4'])

In [5]:
df2

  name arr3 arr4
0    a    1    2
1    t    2    3
2    u    4    5

In [6]:
df3=pd.DataFrame(np.array([['a',7,8],['l',7,9],['k',7,9]]),columns=['name','arr5','arr6'])

In [7]:
df3

  name arr5 arr6
0    a    7    8
1    l    7    9
2    k    7    9

In [8]:
pd.merge(df1,df2,left_on='name',right_on='name',how='inner')

  name arr1 arr2 arr3 arr4
0    a    1    2    1    2

In [9]:
pd.merge(df3,pd.merge(df1,df2))

  name arr5 arr6 arr1 arr2 arr3 arr4
0    a    7    8    1    2    1    2

In [10]:
mydata={'number':[1,2,3,4],
       'stu_id':['ab-1','we-4','tr-7','uy-6'],
       'region':['south','north','east','west']}

In [11]:
len(mydata)

3

In [12]:
type(mydata)

dict

In [13]:
file1=pd.DataFrame(mydata)

In [14]:
file1

   number stu_id region
0       1   ab-1  south
1       2   we-4  north
2       3   tr-7   east
3       4   uy-6   west

In [25]:
type(file1['region'])

pandas.core.series.Series

In [26]:
type(file1[['stu_id']])

pandas.core.frame.DataFrame

In [33]:
mydata2={'n1':[1,2,3,4,5],
       'stu_id1':['ab-1','we-4','te-7','uy-6','uy-5'],
       'region1':['south','north','nort-east','west','south-east']}

In [34]:
file2=pd.DataFrame(mydata2)

In [35]:
file2

   n1 stu_id1     region1
0   1    ab-1       south
1   2    we-4       north
2   3    te-7   nort-east
3   4    uy-6        west
4   5    uy-5  south-east

In [36]:
pd.concat([file1,file2],axis=0)

D:\an\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    n1  number region     region1 stu_id stu_id1
0  NaN     1.0  south         NaN   ab-1     NaN
1  NaN     2.0  north         NaN   we-4     NaN
2  NaN     3.0   east         NaN   tr-7     NaN
3  NaN     4.0   west         NaN   uy-6     NaN
0  1.0     NaN    NaN       south    NaN    ab-1
1  2.0     NaN    NaN       north    NaN    we-4
2  3.0     NaN    NaN   nort-east    NaN    te-7
3  4.0     NaN    NaN        west    NaN    uy-6
4  5.0     NaN    NaN  south-east    NaN    uy-5

In [37]:
pd.concat([file1,file2],axis=1)

   number stu_id region  n1 stu_id1     region1
0     1.0   ab-1  south   1    ab-1       south
1     2.0   we-4  north   2    we-4       north
2     3.0   tr-7   east   3    te-7   nort-east
3     4.0   uy-6   west   4    uy-6        west
4     NaN    NaN    NaN   5    uy-5  south-east

In [38]:
pd.merge(file1,file2,left_on='region',right_on='region1',how='inner')

   number stu_id region  n1 stu_id1 region1
0       1   ab-1  south   1    ab-1   south
1       2   we-4  north   2    we-4   north
2       4   uy-6   west   4    uy-6    west

In [40]:
pd.merge(file1,file2,left_on='region',right_on='region1',how='left')

   number stu_id region   n1 stu_id1 region1
0       1   ab-1  south  1.0    ab-1   south
1       2   we-4  north  2.0    we-4   north
2       3   tr-7   east  NaN     NaN     NaN
3       4   uy-6   west  4.0    uy-6    west

In [43]:
pd.merge(file1,file2,left_on='region',right_on='region1',how='right')

   number stu_id region  n1 stu_id1     region1
0     1.0   ab-1  south   1    ab-1       south
1     2.0   we-4  north   2    we-4       north
2     4.0   uy-6   west   4    uy-6        west
3     NaN    NaN    NaN   3    te-7   nort-east
4     NaN    NaN    NaN   5    uy-5  south-east

In [45]:
pd.merge(file1,file2,left_on='region',right_on='region1',how='outer')

   number stu_id region   n1 stu_id1     region1
0     1.0   ab-1  south  1.0    ab-1       south
1     2.0   we-4  north  2.0    we-4       north
2     3.0   tr-7   east  NaN     NaN         NaN
3     4.0   uy-6   west  4.0    uy-6        west
4     NaN    NaN    NaN  3.0    te-7   nort-east
5     NaN    NaN    NaN  5.0    uy-5  south-east

In [46]:
dataset={'country':['IN','AS','PK','SH'],
       'stu_id':['ab-1','we-4','tr-7','uy-6'],
       'region':['south','north','east','west']}

In [47]:
dataset

{'country': ['IN', 'AS', 'PK', 'SH'],
 'stu_id': ['ab-1', 'we-4', 'tr-7', 'uy-6'],
 'region': ['south', 'north', 'east', 'west']}

In [49]:
info=pd.DataFrame(dataset)

In [50]:
info

  country stu_id region
0      IN   ab-1  south
1      AS   we-4  north
2      PK   tr-7   east
3      SH   uy-6   west

In [56]:
info.iloc[2:3,1:2]

  stu_id
2   tr-7

In [57]:
info.index=['A','B','C','D']

In [58]:
info

  country stu_id region
A      IN   ab-1  south
B      AS   we-4  north
C      PK   tr-7   east
D      SH   uy-6   west